Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LE_DFP/1.0.110/edc/PIC32CM1216LE00064.PIC
      <edc:SFRDef edc:_addr="0x40002801" edc:access="---nnnnn" edc:cname="NMICTRL" edc:impl="0x1F" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="EIC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EIC">
            <edc:SFRFieldDef edc:cname="NMISENSE" edc:desc="Non-Maskable Interrupt Sense Configuration" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No detection" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="RISE" edc:desc="Rising-edge detection" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="FALL" edc:desc="Falling-edge detection" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="BOTH" edc:desc="Both-edges detection" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="HIGH" edc:desc="High-level detection" edc:when="(field &amp; 0x7) == 4"/>
              <edc:SFRFieldSemantic edc:cname="LOW" edc:desc="Low-level detection" edc:when="(field &amp; 0x7) == 5"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="NMIFILTEN" edc:desc="Non-Maskable Interrupt Filter Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NMIASYNCH" edc:desc="Asynchronous Edge Detection Mode" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="SYNC" edc:desc="Edge detection is clock synchronously operated" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ASYNC" edc:desc="Edge detection is clock asynchronously operated" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40002802" edc:access="-------n" edc:cname="NMIFLAG" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="EIC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EIC">
            <edc:SFRFieldDef edc:cname="NMI" edc:desc="Non-Maskable Interrupt" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40002803" edc:offset="0x1"/>
      <edc:SFRDef edc:_addr="0x40002804" edc:access="------------------------------rr" edc:cname="SYNCBUSY" edc:impl="0x3" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="EIC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EIC">
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="Software Reset Synchronization Busy Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="Enable Synchronization Busy Status" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40002808" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="EVCTRL" edc:impl="0xFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="EIC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EIC">
            <edc:SFRFieldDef edc:cname="EXTINTEO0" edc:desc="External Interrupt 0 Event Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINTEO1" edc:desc="External Interrupt 1 Event Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINTEO2" edc:desc="External Interrupt 2 Event Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINTEO3" edc:desc="External Interrupt 3 Event Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINTEO4" edc:desc="External Interrupt 4 Event Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINTEO5" edc:desc="External Interrupt 5 Event Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINTEO6" edc:desc="External Interrupt 6 Event Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINTEO7" edc:desc="External Interrupt 7 Event Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINTEO8" edc:desc="External Interrupt 8 Event Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINTEO9" edc:desc="External Interrupt 9 Event Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINTEO10" edc:desc="External Interrupt 10 Event Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINTEO11" edc:desc="External Interrupt 11 Event Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINTEO12" edc:desc="External Interrupt 12 Event Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINTEO13" edc:desc="External Interrupt 13 Event Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINTEO14" edc:desc="External Interrupt 14 Event Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINTEO15" edc:desc="External Interrupt 15 Event Output Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4000280C" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="INTENCLR" edc:impl="0xFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="EIC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EIC">
            <edc:SFRFieldDef edc:cname="EXTINT0" edc:desc="External Interrupt 0 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT1" edc:desc="External Interrupt 1 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT2" edc:desc="External Interrupt 2 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT3" edc:desc="External Interrupt 3 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT4" edc:desc="External Interrupt 4 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT5" edc:desc="External Interrupt 5 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT6" edc:desc="External Interrupt 6 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT7" edc:desc="External Interrupt 7 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT8" edc:desc="External Interrupt 8 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT9" edc:desc="External Interrupt 9 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT10" edc:desc="External Interrupt 10 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT11" edc:desc="External Interrupt 11 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT12" edc:desc="External Interrupt 12 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT13" edc:desc="External Interrupt 13 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT14" edc:desc="External Interrupt 14 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT15" edc:desc="External Interrupt 15 Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40002810" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="INTENSET" edc:impl="0xFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="EIC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EIC">
            <edc:SFRFieldDef edc:cname="EXTINT0" edc:desc="External Interrupt 0 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT1" edc:desc="External Interrupt 1 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT2" edc:desc="External Interrupt 2 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT3" edc:desc="External Interrupt 3 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT4" edc:desc="External Interrupt 4 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT5" edc:desc="External Interrupt 5 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT6" edc:desc="External Interrupt 6 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT7" edc:desc="External Interrupt 7 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT8" edc:desc="External Interrupt 8 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT9" edc:desc="External Interrupt 9 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT10" edc:desc="External Interrupt 10 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT11" edc:desc="External Interrupt 11 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT12" edc:desc="External Interrupt 12 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT13" edc:desc="External Interrupt 13 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT14" edc:desc="External Interrupt 14 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT15" edc:desc="External Interrupt 15 Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40002814" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="INTFLAG" edc:impl="0xFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="EIC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EIC">
            <edc:SFRFieldDef edc:cname="EXTINT0" edc:desc="External Interrupt 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT1" edc:desc="External Interrupt 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT2" edc:desc="External Interrupt 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT3" edc:desc="External Interrupt 3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT4" edc:desc="External Interrupt 4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT5" edc:desc="External Interrupt 5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT6" edc:desc="External Interrupt 6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT7" edc:desc="External Interrupt 7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT8" edc:desc="External Interrupt 8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT9" edc:desc="External Interrupt 9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT10" edc:desc="External Interrupt 10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT11" edc:desc="External Interrupt 11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT12" edc:desc="External Interrupt 12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT13" edc:desc="External Interrupt 13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT14" edc:desc="External Interrupt 14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT15" edc:desc="External Interrupt 15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40002818" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="ASYNCH" edc:impl="0xFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="EIC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EIC">
            <edc:SFRFieldDef edc:cname="ASYNCH0" edc:desc="Asynchronous Edge Detection Mode of EXTINT0" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="SYNC" edc:desc="Edge detection is clock synchronously operated" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ASYNC" edc:desc="Edge detection is clock asynchronously operated" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ASYNCH1" edc:desc="Asynchronous Edge Detection Mode of EXTINT1" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="SYNC" edc:desc="Edge detection is clock synchronously operated" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ASYNC" edc:desc="Edge detection is clock asynchronously operated" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ASYNCH2" edc:desc="Asynchronous Edge Detection Mode of EXTINT2" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="SYNC" edc:desc="Edge detection is clock synchronously operated" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ASYNC" edc:desc="Edge detection is clock asynchronously operated" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ASYNCH3" edc:desc="Asynchronous Edge Detection Mode of EXTINT3" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="SYNC" edc:desc="Edge detection is clock synchronously operated" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ASYNC" edc:desc="Edge detection is clock asynchronously operated" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ASYNCH4" edc:desc="Asynchronous Edge Detection Mode of EXTINT4" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="SYNC" edc:desc="Edge detection is clock synchronously operated" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ASYNC" edc:desc="Edge detection is clock asynchronously operated" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ASYNCH5" edc:desc="Asynchronous Edge Detection Mode of EXTINT5" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="SYNC" edc:desc="Edge detection is clock synchronously operated" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ASYNC" edc:desc="Edge detection is clock asynchronously operated" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ASYNCH6" edc:desc="Asynchronous Edge Detection Mode of EXTINT6" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="SYNC" edc:desc="Edge detection is clock synchronously operated" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ASYNC" edc:desc="Edge detection is clock asynchronously operated" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ASYNCH7" edc:desc="Asynchronous Edge Detection Mode of EXTINT7" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="SYNC" edc:desc="Edge detection is clock synchronously operated" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ASYNC" edc:desc="Edge detection is clock asynchronously operated" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ASYNCH8" edc:desc="Asynchronous Edge Detection Mode of EXTINT8" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="SYNC" edc:desc="Edge detection is clock synchronously operated" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ASYNC" edc:desc="Edge detection is clock asynchronously operated" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ASYNCH9" edc:desc="Asynchronous Edge Detection Mode of EXTINT9" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="SYNC" edc:desc="Edge detection is clock synchronously operated" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ASYNC" edc:desc="Edge detection is clock asynchronously operated" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ASYNCH10" edc:desc="Asynchronous Edge Detection Mode of EXTINT10" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="SYNC" edc:desc="Edge detection is clock synchronously operated" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ASYNC" edc:desc="Edge detection is clock asynchronously operated" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ASYNCH11" edc:desc="Asynchronous Edge Detection Mode of EXTINT11" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="SYNC" edc:desc="Edge detection is clock synchronously operated" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ASYNC" edc:desc="Edge detection is clock asynchronously operated" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ASYNCH12" edc:desc="Asynchronous Edge Detection Mode of EXTINT12" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="SYNC" edc:desc="Edge detection is clock synchronously operated" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ASYNC" edc:desc="Edge detection is clock asynchronously operated" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ASYNCH13" edc:desc="Asynchronous Edge Detection Mode of EXTINT13" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="SYNC" edc:desc="Edge detection is clock synchronously operated" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ASYNC" edc:desc="Edge detection is clock asynchronously operated" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ASYNCH14" edc:desc="Asynchronous Edge Detection Mode of EXTINT14" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="SYNC" edc:desc="Edge detection is clock synchronously operated" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ASYNC" edc:desc="Edge detection is clock asynchronously operated" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ASYNCH15" edc:desc="Asynchronous Edge Detection Mode of EXTINT15" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="SYNC" edc:desc="Edge detection is clock synchronously operated" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ASYNC" edc:desc="Edge detection is clock asynchronously operated" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
