Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LE_DFP/1.0.110/edc/PIC32CM1216LE00064.PIC
      <edc:AdjustPoint edc:_addr="0x4100A001" edc:offset="0x1"/>
      <edc:SFRDef edc:_addr="0x4100A002" edc:access="------rr" edc:cname="SYNCBUSY" edc:impl="0x3" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="USB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="Software Reset Synchronization Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="Enable Synchronization Busy" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4100A003" edc:access="----nnnn" edc:cname="QOSCTRL" edc:impl="0xF" edc:mclr="00001111" edc:nzwidth="0x8" edc:por="00001111" ltx:memberofperipheral="USB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:SFRFieldDef edc:cname="CQOS" edc:desc="Configuration Quality of Service" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="DQOS" edc:desc="Data Quality of Service" edc:nzwidth="0x2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4100A004" edc:offset="0x9"/>
      <edc:SFRDef edc:_addr="0x4100A00D" edc:access="-rrrrrrr" edc:cname="FSMSTATUS" edc:impl="0x7F" edc:mclr="00000001" edc:nzwidth="0x8" edc:por="00000001" ltx:memberofperipheral="USB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:SFRFieldDef edc:cname="FSMSTATE" edc:desc="Fine State Machine Status" edc:nzwidth="0x7">
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="OFF (L3). It corresponds to the powered-off, disconnected, and disabled state" edc:when="(field &amp; 0x7F) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="ON" edc:desc="ON (L0). It corresponds to the Idle and Active states" edc:when="(field &amp; 0x7F) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="SUSPEND" edc:desc="SUSPEND (L2)" edc:when="(field &amp; 0x7F) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="SLEEP" edc:desc="SLEEP (L1)" edc:when="(field &amp; 0x7F) == 0x8"/>
              <edc:SFRFieldSemantic edc:cname="DNRESUME" edc:desc="DNRESUME. Down Stream Resume." edc:when="(field &amp; 0x7F) == 0x10"/>
              <edc:SFRFieldSemantic edc:cname="UPRESUME" edc:desc="UPRESUME. Up Stream Resume." edc:when="(field &amp; 0x7F) == 0x20"/>
              <edc:SFRFieldSemantic edc:cname="RESET" edc:desc="RESET. USB lines Reset." edc:when="(field &amp; 0x7F) == 0x40"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4100A00E" edc:offset="0x16"/>
      <edc:SFRDef edc:_addr="0x4100A024" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DESCADD" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="USB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:SFRFieldDef edc:cname="DESCADD" edc:desc="Descriptor Address Value" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4100A028" edc:access="-nnn-nnnnn-nnnnn" edc:cname="PADCAL" edc:impl="0x77DF" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="USB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:SFRFieldDef edc:cname="TRANSP" edc:desc="USB Pad Transp calibration" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TRANSN" edc:desc="USB Pad Transn calibration" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TRIM" edc:desc="USB Pad Trim calibration" edc:nzwidth="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
    </edc:SFRDataSector>
    <edc:SFRDataSector edc:beginaddr="0x42000000" edc:endaddr="0x42005800" edc:regionid="APBC" edc:rw="rw">
      <edc:SFRDef edc:_addr="0x42000000" edc:access="-------w" edc:cname="CTRLA" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="EVSYS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="Software Reset" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x42000001" edc:offset="0x3"/>
      <edc:SFRDef edc:_addr="0x42000004" edc:access="--------------------wwwwwwwwwwww" edc:cname="SWEVT" edc:impl="0xFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="EVSYS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="CHANNEL0" edc:desc="Channel 0 Software Selection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHANNEL1" edc:desc="Channel 1 Software Selection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHANNEL2" edc:desc="Channel 2 Software Selection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHANNEL3" edc:desc="Channel 3 Software Selection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHANNEL4" edc:desc="Channel 4 Software Selection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHANNEL5" edc:desc="Channel 5 Software Selection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHANNEL6" edc:desc="Channel 6 Software Selection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHANNEL7" edc:desc="Channel 7 Software Selection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHANNEL8" edc:desc="Channel 8 Software Selection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHANNEL9" edc:desc="Channel 9 Software Selection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHANNEL10" edc:desc="Channel 10 Software Selection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHANNEL11" edc:desc="Channel 11 Software Selection" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42000008" edc:access="n----nnn" edc:cname="PRICTRL" edc:impl="0x87" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="EVSYS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="PRI" edc:desc="Channel Priority Number" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="RREN" edc:desc="Round-Robin Scheduling Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
