Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LE_DFP/1.0.110/edc/PIC32CM1216LE00064.PIC
      <edc:SFRDef edc:_addr="0xE000E208" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVIC_ISPR2" edc:nzwidth="0x20" ltx:memberofperipheral="NVIC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVIC">
            <edc:SFRFieldDef edc:cname="SETPEND" edc:desc="Set pending" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0xE000E20C" edc:offset="0x74"/>
      <edc:SFRDef edc:_addr="0xE000E280" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVIC_ICPR0" edc:nzwidth="0x20" ltx:memberofperipheral="NVIC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVIC">
            <edc:SFRFieldDef edc:cname="CLRPEND" edc:desc="Clear pending" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000E284" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVIC_ICPR1" edc:nzwidth="0x20" ltx:memberofperipheral="NVIC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVIC">
            <edc:SFRFieldDef edc:cname="CLRPEND" edc:desc="Clear pending" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000E288" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVIC_ICPR2" edc:nzwidth="0x20" ltx:memberofperipheral="NVIC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVIC">
            <edc:SFRFieldDef edc:cname="CLRPEND" edc:desc="Clear pending" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0xE000E28C" edc:offset="0x74"/>
      <edc:SFRDef edc:_addr="0xE000E300" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="NVIC_IABR0" edc:nzwidth="0x20" ltx:memberofperipheral="NVIC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVIC">
            <edc:SFRFieldDef edc:cname="ACTIVE" edc:desc="Active state" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000E304" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="NVIC_IABR1" edc:nzwidth="0x20" ltx:memberofperipheral="NVIC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVIC">
            <edc:SFRFieldDef edc:cname="ACTIVE" edc:desc="Active state" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000E308" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="NVIC_IABR2" edc:nzwidth="0x20" ltx:memberofperipheral="NVIC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVIC">
            <edc:SFRFieldDef edc:cname="ACTIVE" edc:desc="Active state" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0xE000E30C" edc:offset="0x74"/>
      <edc:SFRDef edc:_addr="0xE000E380" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVIC_ITNS0" edc:nzwidth="0x20" ltx:memberofperipheral="NVIC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVIC">
            <edc:SFRFieldDef edc:cname="ITNS" edc:desc="Interrupt Targets Non-secure" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000E384" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVIC_ITNS1" edc:nzwidth="0x20" ltx:memberofperipheral="NVIC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVIC">
            <edc:SFRFieldDef edc:cname="ITNS" edc:desc="Interrupt Targets Non-secure" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000E388" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVIC_ITNS2" edc:nzwidth="0x20" ltx:memberofperipheral="NVIC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVIC">
            <edc:SFRFieldDef edc:cname="ITNS" edc:desc="Interrupt Targets Non-secure" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0xE000E38C" edc:offset="0x74"/>
      <edc:SFRDef edc:_addr="0xE000E400" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVIC_IPR0" edc:nzwidth="0x20" ltx:memberofperipheral="NVIC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVIC">
            <edc:SFRFieldDef edc:cname="PRI_N0" edc:desc="Priority of interrupt number 4n+0" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N1" edc:desc="Priority of interrupt number 4n+1" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N2" edc:desc="Priority of interrupt number 4n+2" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N3" edc:desc="Priority of interrupt number 4n+3" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000E404" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVIC_IPR1" edc:nzwidth="0x20" ltx:memberofperipheral="NVIC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVIC">
            <edc:SFRFieldDef edc:cname="PRI_N0" edc:desc="Priority of interrupt number 4n+0" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N1" edc:desc="Priority of interrupt number 4n+1" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N2" edc:desc="Priority of interrupt number 4n+2" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N3" edc:desc="Priority of interrupt number 4n+3" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000E408" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVIC_IPR2" edc:nzwidth="0x20" ltx:memberofperipheral="NVIC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVIC">
            <edc:SFRFieldDef edc:cname="PRI_N0" edc:desc="Priority of interrupt number 4n+0" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N1" edc:desc="Priority of interrupt number 4n+1" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N2" edc:desc="Priority of interrupt number 4n+2" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N3" edc:desc="Priority of interrupt number 4n+3" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000E40C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVIC_IPR3" edc:nzwidth="0x20" ltx:memberofperipheral="NVIC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVIC">
            <edc:SFRFieldDef edc:cname="PRI_N0" edc:desc="Priority of interrupt number 4n+0" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N1" edc:desc="Priority of interrupt number 4n+1" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N2" edc:desc="Priority of interrupt number 4n+2" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N3" edc:desc="Priority of interrupt number 4n+3" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000E410" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVIC_IPR4" edc:nzwidth="0x20" ltx:memberofperipheral="NVIC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVIC">
            <edc:SFRFieldDef edc:cname="PRI_N0" edc:desc="Priority of interrupt number 4n+0" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N1" edc:desc="Priority of interrupt number 4n+1" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N2" edc:desc="Priority of interrupt number 4n+2" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N3" edc:desc="Priority of interrupt number 4n+3" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000E414" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVIC_IPR5" edc:nzwidth="0x20" ltx:memberofperipheral="NVIC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVIC">
            <edc:SFRFieldDef edc:cname="PRI_N0" edc:desc="Priority of interrupt number 4n+0" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N1" edc:desc="Priority of interrupt number 4n+1" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N2" edc:desc="Priority of interrupt number 4n+2" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N3" edc:desc="Priority of interrupt number 4n+3" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000E418" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVIC_IPR6" edc:nzwidth="0x20" ltx:memberofperipheral="NVIC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVIC">
            <edc:SFRFieldDef edc:cname="PRI_N0" edc:desc="Priority of interrupt number 4n+0" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N1" edc:desc="Priority of interrupt number 4n+1" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N2" edc:desc="Priority of interrupt number 4n+2" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N3" edc:desc="Priority of interrupt number 4n+3" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
